CodeIgniter/codeigniter4-framework-v4.5.1-0-g9b2cd73/app/Controllers/Emails.php

    public function create()
    {
        helper('form');

        $data = $this->request->getPost(['title', 'recepient', 'body']);

        // Checks whether the submitted data passed the validation rules.
        if (! $this->validateData($data, [
            'title' => 'required|max_length[255]|min_length[3]',
            'recepient' => 'required|max_length[255]|min_length[3]',
            'body'  => 'required|max_length[5000]|min_length[10]',
        ])) {
            // The validation fails, so returns the form.
            return $this->new();
        }

        // Gets the validated data.
        $post = $this->validator->getValidated();

        $model = model(emailModel::class);

        $model->save([
            'title' => $post['title'],
            'recepient'  => $post['recepient'],
            'body'  => $post['body'],
        ]);
---
INSERT INTO `emails` (`title`, `recepient`, `body`) VALUES ('bob', 'bob@bob.com', 'Hi bob, just wanted to say hi!')