CodeIgniter/codeigniter4-framework-v4.5.1-0-g9b2cd73/app/Models/EmailModel.php

    public function getEmail($title = false)
    {
        if ($title === false) {
            return $this->findAll();
        }

        return $this->where(['title' => $title])->first();
---
SELECT *
FROM `emails`
SELECT *
FROM `emails`
WHERE `title` = 'bob'
 LIMIT 1