CodeIgniter/codeigniter4-framework-v4.5.1-0-g9b2cd73/app/Models/NewsModel.php

SELECT *
FROM `news`
SELECT *
FROM `news`
WHERE `slug` = 'tutorial-completed'
 LIMIT 1
---
    public function getNews($slug = false)
    {
        if ($slug === false) {
            return $this->findAll();
        }

        return $this->where(['slug' => $slug])->first();